#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <windows.h>
#include <conio.h> //Para uso do _kbhit e do _getch
#include <time.h>

// cores
#define GREEN "\033[32m"
#define RESET "\033[0m"
#define RED "\033[31m"
#define YELLOW "\033[33m"

// definidas pelo caio ↓
#define TAM_VILA 10
#define TAM_F1 10
#define TAM_F2 20
#define TAM_F3 40
#define FASE 4
#define TAM 40

//=========== artes em asci=========
char mapa[4][40][40];

char mapabackup[4][40][40] =
    // mapa vila 0 ↓
    {{{' ', ' ', '*', '*', '*', '*', '*', '*', '*', '*'},
      {' ', ' ', '*', 'g', 'g', 'g', 'g', 'g', 'g', '*'},
      {'*', '*', '*', 'g', 'g', 'g', 'g', 'g', 'g', '*'},
      {'*', 'g', 'g', 'g', 'P', 'g', 'g', 'g', 'g', '*'},
      {'*', 'D', 'g', 'g', 'g', 'g', 'g', 'g', 'g', '*'},
      {'*', 'D', 'g', 'g', 'g', '&', 'g', 'g', 'g', '*'},
      {'*', 'g', 'g', 'g', 'g', 'g', 'g', 'g', 'g', '*'},
      {'*', '*', '*', 'g', 'g', 'g', 'g', '@', 'g', '*'},
      {' ', ' ', '*', 'g', 'g', 'g', 'g', 'g', 'g', '*'},
      {' ', ' ', '*', '*', '*', '*', '*', '*', '*', '*'}},
     // mapa fase 1 ↓
     {{'*', '*', '*', '*', '*', '*', '*', '*', '*', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '&', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', '@', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'D', '*'},
      {'*', '*', '*', '*', '*', '*', '*', '*', '*', '*'}},
     // mapa fase 2 ↓
     {{'*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', 'X', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', 'X', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', '#', '#', ' ', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', '#', 'O', ' ', '#', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', '#', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '#', ' ', '#', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', '#', '#', '#', '#', ' ', ' ', ' ', ' ', ' ', '#', '@', '#', ' ', ' ', ' ', '*'},
      {'*', ' ', 'D', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '&', ' ', ' ', '*'},
      {'*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*'}},
     // mapa fase 3 ↓
     {{'*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', '#', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', '>', ' ', ' ', '#', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', 'O', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', '*', '*', '*', '*'},
      {'*', '#', '#', '#', '#', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', '>', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', '@', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', '*', '*', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', '#', '#', '*', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', 'X', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', 'L', 'L', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', 'L', 'L', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', 'L', 'L', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', 'L', 'L', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', 'X', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', '*', '*', '*', '*', '*', '*', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', 'V', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', '*', '*', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', '*', '*', '*', '*', '*', '*', ' ', ' ', ' ', '*', '*', '*', '*', '*', '*', '*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', 'D', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', '#', '#', '*'},
      {'*', ' ', '&', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', 'X', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
      {'*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*'}}};

char cutscene1[50][160] = {
    {"                                                                                                                      \n"},
    {"                                                                                                                      \n"},
    {"                                                                      ##########               ###########            \n"},
    {"                                                                      (*       (               %#        (            \n"},
    {"                                                                      %####&##%(               #%#.. . *(#            \n"},
    {"                                                                      #,/, .   #               (* ,  .   %            \n"},
    {"                        #%#((%%#%                       &%            ##. %/ . (%%%  %%##% /%%%%*.., # .,#            \n"},
    {"                     #*/ .,* . .    %                 # .#            %,/.(.   , .*.         **/(.(, ,   #            \n"},
    {"                   &. *%..             %            %(/( .            #,,.      . *,  .    * , *//*./    &            \n"},
    {"                  #.(/./ / , .    .  .   #         # ,/   /           #.        , .   (      .//*/(      %            \n"},
    {"                 ,##,,( .. . .* *  .   %%%        #/.     /           %**. .   .   .*.    .. ,,(/,.,   . #            \n"},
    {"                 #,/#.(,/(.,,*/ .. ,. #(         # ..    #            #*.*, . .   . /%#%##   ,*/%(.      (            \n"},
    {"                  #,(#*./,(. ...  .,  %%        &,..    #             #,..    , .  .%%%%%#%.%./(*/* ,.   %            \n"},
    {"                   #/**,***./  ,   ,..#         ., /   &              ,/.. .  /*,.  ####%%% ( ,/., ..  . %            \n"},
    {"                 ####%%%&#/#.(*/ /%(.#         % .    ,               ,,,. , ... &, /##%&##./*(%  .   ,. #            \n"},
    {"               #*%. /..*.     #%(%%           %.*     (                                                               \n"},
    {"            /#%##*,*,*..  /***/*,.%          %,*     (                                                                \n"},
    {"         %%,/%(/,,/%,%*(,(####/, #(%        # ,(,   #                                                                 \n"},
    {"        # ***.(%(.*/,#(**( /      .  #     %. ...  *                                                                  \n"},
    {"       #.(*,,,(((..,/*.*/,,* .. %#*  .%    *... .  #                                                                  \n"},
    {"      %../* ((,.#(#.*,(. ...  /#. *   %   #,,..   (                                                                   \n"},
    {"     %.,(,(***,#*.  ** *  ,.  %* *     %  (%/(/, (                                                                    \n"},
    {"     #.*#/..(%*,((.*/  *,*.  #*., .    # %%((/*.*.#%                                                                  \n"},
    {"    .**.( ///(* *,. ,  ./  . # *(,.    ##//(,.* ###(                                                                  \n"},
    {"    (,,., (*..,.,(.. %*/*/(./#%**.(.   %(&,,%.*%/                                                                     \n"},
    {"    # /, /( ..  /..*.,*   , %#%.,,*,  , ,#(/,(.&                                                                      \n"},
    {"   %., /, * .*,(.. ./*..,*.(%(*%., (*. , #*( .#                                                                       \n"},
    {"   (,*.// /*     ./.  ..  .*%(/(%#/,(,.#/&%                                                                           \n"},
    {"   (. .,.. ., ., *, . ..   .*/(,*##(.#  ##,                                                                           \n"},
    {"  (  *.    *,    ..        %/  ,..(*.#                                                                                \n"},
    {"    .                 *    # **                                                                                       \n"},
    {"                                                                                                                      \n"},
    {"   #%&%%%#%%#%%&%#%%%%%#%#%#&#%%%&%%%%%%&&#%&%&#%&%#%&%%###&(&##&&##&%%&%%%&%##&%%&%%%%%%%%%%%%%@&%%&%%%#%%&&&&#%%%%&#\n"},
    {"   %                                      ___     ____          _       _                                            %\n"},
    {"   #                                     / _ \\   / ___|__ _ ___| |_ ___| | ___     ___                               #\n"},
    {"   #                                    | | | | | |   / _` / __| __/ _ \\ |/ _ \\   / _ \\                              #\n"},
    {"   %                                    | |_| | | |__| (_| \\__ \\ ||  __/ | (_) | | (_) |                             %\n"},
    {"   #                                     \\___/   \\____\\__,_|___/\\__\\___|_|\\___/   \\___/                              #\n"},
    {"   #                                       __| | ___  ___  __ _ / _(_) __ _                                          %\n"},
    {"   %                                      / _` |/ _ \\/ __|/ _` | |_| |/ _` |                                         %\n"},
    {"   #                                     | (_| |  __/\\__ \\ (_| |  _| | (_| |_ _ _ _ _ _ _ _ _ _                      %\n"},
    {"   %                                     \\__,_|\\___||___/\\__,_|_| |_|\\__,_(_|_|_|_|_|_|_|_|_|_)                      #\n"},
    {"   %                                                                                                                 #\n"},
    {"   (#((//**/,,,*//.(//*,*//(/,//*#(*///(//*(/(**/(((/((((**//*/((/*/((((/*(#(((//(**/,//**/,*/(///////****//(**//#(# \n"}};

// menu em ascii ↓
char menuletra[10][250] = {
    {" _____ ______   _______   ________   ___  ___      \n"},
    {"|\\   _ \\  _   \\|\\  ___ \\ |\\   ___  \\|\\  \\|\\  \\     \n"},
    {"\\ \\  \\\\\\__\\ \\  \\ \\   __/|\\ \\  \\\\ \\  \\ \\  \\\\\\  \\    \n"},
    {" \\ \\  \\\\|__| \\  \\ \\  \\_|/_\\ \\  \\\\ \\  \\ \\  \\\\\\  \\   \n"},
    {"  \\ \\  \\    \\ \\  \\ \\  \\_|\\ \\ \\  \\\\ \\  \\ \\  \\\\\\  \\  \n"},
    {"   \\ \\__\\    \\ \\__\\ \\_______\\ \\__\\\\ \\__\\ \\_______\\ \n"},
    {"    \\|__|     \\|__|\\|_______|\\|__| \\|__|\\|_______| \n"}};

int jogadorX = 1, jogadorY = 1;
int posInicialX = 1, posInicialY = 1;
int chaveColetada = 0;
int reinicios = 0;
int interacao = 0;
int i, j, k;
int faseatual = 0;
// armazena o que ta embaixo do jogador (pode ser ' ', '@', etc.)
char embaixoDoJogador = ' ';

void imprimirMapa()
{

    if (faseatual == 0)
    {
        for (i = 0; i < TAM_VILA; i++)
        {
            for (j = 0; j < TAM_VILA; j++)
            {
                int valorandom = rand() % 2;
                if (valorandom == 0 && mapa[0][i][j] == 'g')
                {
                    printf(GREEN "'" RESET " " /*,mapa[0][i][j]*/);
                }
                else if (valorandom == 1 && mapa[0][i][j] == 'g')
                {
                    printf(GREEN "," RESET " " /*,mapa[0][i][j]*/);
                }
                else
                {
                    printf("%c ", mapa[faseatual][i][j]);
                }
            }
            printf("\n");
        }
    }
    else if (faseatual == 1)
    {
        for (i = 0; i < TAM_F1; i++)
        {
            for (j = 0; j < TAM_F1; j++)
            {
                printf("%c ", mapa[faseatual][i][j]);
            }
            printf("\n");
        }
    }
    else if (faseatual == 2)
    {
        for (i = 0; i < TAM_F2; i++)
        {
            for (j = 0; j < TAM_F2; j++)
            {
                printf("%c ", mapa[faseatual][i][j]);
            }
            printf("\n");
        }
    }
    else
    {
        for (i = 0; i < TAM_F3; i++)
        {
            for (j = 0; j < TAM_F3; j++)
            {
                int valorandom = rand() % 2;
                if (valorandom == 0 && mapa[faseatual][i][j] == 'L')
                {
                    printf(RED "'" RESET " " /*,mapa[0][i][j]*/);
                }
                else if (valorandom == 1 && mapa[faseatual][i][j] == 'L')
                {
                    printf(YELLOW "," RESET " " /*,mapa[0][i][j]*/);
                }
                else
                {
                    printf("%c ", mapa[faseatual][i][j]);
                }
            }
            printf("\n");
        }
    }
}

void resetarJogador()
{
    mapa[faseatual][jogadorY][jogadorX] = embaixoDoJogador; // restaura o que estava ali
    jogadorX = posInicialX;
    jogadorY = posInicialY;
    embaixoDoJogador = ' '; // posição inicial é chão
    mapa[faseatual][jogadorY][jogadorX] = '&';
}

void moverJogador(char tecla)
{
    int novoX = jogadorX;
    int novoY = jogadorY;

    if (tecla == 'w')
        novoY--;
    else if (tecla == 's')
        novoY++;
    else if (tecla == 'a')
        novoX--;
    else if (tecla == 'd')
        novoX++;
    else
        return;

    char destino = mapa[faseatual][novoY][novoX];

    if (destino == '*' || destino == 'D' || destino == 'P')
    {
        return;
    }

    if (destino == '#' || destino == 'X' || destino == 'V')
    {
        printf("Você morreu!\n");
        reinicios++;
        if (reinicios >= 3)
        {
            printf("Reiniciou 3 vezes. Voltando ao menu.\n");
            exit(0);
        }
        system("pause");
        resetarJogador();
        return;
    }

    // mover o jogador
    mapa[faseatual][jogadorY][jogadorX] = embaixoDoJogador; // restaura o que estava antes
    embaixoDoJogador = destino;                             // salva o que está na nova posição
    jogadorX = novoX;
    jogadorY = novoY;
    mapa[faseatual][jogadorY][jogadorX] = '&';
}

void PosInicialVariavel()
{
    int i, j;
    for (i = 0; i < 40; i++)
    {
        for (j = 0; j < 40; j++)
        {
            if (mapa[faseatual][i][j] == '&')
            {
                posInicialX = j;
                posInicialY = i;
                jogadorY = i;
                jogadorX = j;
                break;
            }
        }
    }
}

void LimpaPersonagemDaFase()
{
    int i, j;
    int tam;
    if (faseatual == 0)
        tam = TAM_VILA;
    else if (faseatual == 1)
        tam = TAM_F1;
    else if (faseatual == 2)
        tam = TAM_F2;
    else if (faseatual == 3)
        tam = TAM_F3;

    for (i = 0; i < tam; i++)
    {
        for (j = 0; j < tam; j++)
        {
            if (mapa[faseatual][i][j] == '&')
            {
                mapa[faseatual][i][j] = ' ';
            }
        }
    }
}

void interagir()
{

    if (embaixoDoJogador == '@')
    {
        chaveColetada = 1;
        embaixoDoJogador = ' ';
        printf("Você pegou a chave!\n");
        if (faseatual == 0)
        {
            for (i = 0; i < TAM_VILA; i++)
            {
                for (j = 0; j < TAM_VILA; j++)
                {
                    if (mapa[faseatual][i][j] == 'D')
                    {
                        mapa[faseatual][i][j] = '=';
                    }
                }
            }
        }
        else if (faseatual == 1)
        {
            for (i = 0; i < TAM_F1; i++)
            {
                for (j = 0; j < TAM_F1; j++)
                {
                    if (mapa[faseatual][i][j] == 'D')
                    {
                        mapa[faseatual][i][j] = '=';
                    }
                }
            }
        }
        else if (faseatual == 2)
        {
            for (i = 0; i < TAM_F2; i++)
            {
                for (j = 0; j < TAM_F2; j++)
                {
                    if (mapa[faseatual][i][j] == 'D')
                    {
                        mapa[faseatual][i][j] = '=';
                    }
                }
            }
        }
        else
        {
            for (i = 0; i < TAM_F3; i++)
            {
                for (j = 0; j < TAM_F3; j++)
                {
                    if (mapa[faseatual][i][j] == 'D')
                    {
                        mapa[faseatual][i][j] = '=';
                    }
                    mapa[faseatual][27][3] = ' ';
                    mapa[faseatual][26][3] = ' ';
                    mapa[faseatual][25][3] = ' ';
                }
            }
        }
        system("pause");
    }
    else if (embaixoDoJogador == '=' && chaveColetada)
    {
        printf("Você abriu a porta!\n");
        LimpaPersonagemDaFase(faseatual);
        faseatual++;
        PosInicialVariavel();
        system("pause");
    }
    else if (embaixoDoJogador == 'O')
    {
        printf("Você apertou o botão!\n");
        if (faseatual == 2)
        {
            mapa[2][14][14] = ' ';
        }
        else if (faseatual == 3)
        {
            mapa[3][34][36] = ' ';
            for (i = 8; i < 22; i++)
            {
                mapa[3][i][23] = '*';
            }
        }
        system("pause");
    }
    else if (embaixoDoJogador == '>')
    {
        for (i = 0; i < TAM_F3; i++)
        {
            for (j = 0; j < TAM_F3; j++)
            {
                if (mapa[faseatual][i][j] == '>' && !(i == jogadorY && j == jogadorX))
                {
                    mapa[faseatual][jogadorY][jogadorX] = '>';
                    jogadorX = j;
                    jogadorY = i;
                    mapa[faseatual][jogadorY][jogadorX] = '&';
                    return;
                }
            }
        }
    }
}

void moverMonstroAleatorio()
{
    int x, y;
    int tam;
    if (faseatual == 2)
    {
        tam = TAM_F2;
    }
    else if (faseatual == 3)
    {
        tam = TAM_F3;
    }
    while (faseatual == 2 || faseatual == 3)
    {
        for (y = 0; y < tam; y++)
        {
            for (x = 0; x < tam; x++)
            {
                if (mapa[faseatual][y][x] == 'X')
                {
                    int dir = rand() % 4;
                    int novoX = x;
                    int novoY = y;

                    if (dir == 0)
                        novoY--;
                    else if (dir == 1)
                        novoY++;
                    else if (dir == 2)
                        novoX--;
                    else if (dir == 3)
                        novoX++;

                    if (mapa[faseatual][novoY][novoX] == ' ' || mapa[faseatual][novoY][novoX] == '&')
                    {
                        if (mapa[faseatual][novoY][novoX] == '&')
                        {
                            printf("O monstro te pegou!\n");
                            reinicios++;
                            if (reinicios >= 3)
                            {
                                printf("Reiniciou 3 vezes. Voltando ao menu.\n");
                                exit(0);
                            }
                            system("pause");
                            resetarJogador();
                            return;
                        }
                        mapa[faseatual][novoY][novoX] = 'X';
                        mapa[faseatual][y][x] = ' ';
                        return;
                    }
                }
            }
        }
    }
}

void RodarOJogo()
{
    system("cls");
    imprimirMapa();

    if (_kbhit())
    { //_kbhit e _getch reconhecem a tecla pressionada no teclado e puxa do caractere referente
        char tecla = _getch();
        if (tecla == 'i')
        {
            interagir();
        }
        else if (tecla == 'm')
        {
            LimpaPersonagemDaFase(faseatual);
            faseatual++;
            PosInicialVariavel();
        }
        else
        {
            moverJogador(tecla);
        }
    }

    moverMonstroAleatorio();
    Sleep(200);
}

int main()
{
    srand(time(NULL));
    setlocale(LC_ALL, "pt_BR.UTF-8");
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);
    //======== isso aqui faz com que o terminal windows aceite o código ANSI, que é do tipo utilizado no meu define ali em cima, ou seja, permita eu colorir os caracteres de uma forma mais simples.
    HANDLE hOut = GetStdHandle(STD_OUTPUT_HANDLE);
    DWORD dwMode = 0;
    GetConsoleMode(hOut, &dwMode);
    dwMode |= 0x0004; // ENABLE_VIRTUAL_TERMINAL_PROCESSING
    SetConsoleMode(hOut, dwMode);

    int linha, coluna;

    // =============================== programa em sim aqui ====================================
    // =============================== programa em sim aqui ====================================
    // =============================== programa em sim aqui ====================================
    // =============================== programa em sim aqui ====================================
    // =============================== programa em sim aqui ====================================
    // =============================== programa em sim aqui ====================================
    // ======================AAAAAAAAA programa em sim aqui AAAAAAAAA===========================
    // ========================AAAAAAA programa em sim aqui AAAAAAA=============================
    // ==========================AAAAA programa em sim aqui AAAAA===============================
    // ============================AAA programa em sim aqui AAA=================================
    // ==============================A programa em sim aqui A===================================
    // ================================= programa em sim  ======================================
    // =================================== ograma em s  ========================================
    // ===================================== grama em ==========================================
    // ======================================= rama ============================================
    // =========================================  ==============================================
    // =========================================================================================

    int menu = 0;
    while (menu != 3) // jogo começa aqui
    {
        int i = 0;
        int j = 9; //<------JAMAIS MUDAR ESSA VARIAVEL PARA 10 OU MAIS
        int tempo = 0;
        int menu_contador = 10;
        int teste = 0;
        int morto = 0;
        int l, p, k;

        for (l = 0; l < 5; l++)
        {
            for (p = 0; p < 40; p++)
            {
                for (k = 0; k < 40; k++)
                {
                    mapa[l][p][k] = mapabackup[l][p][k];
                }
            }
        }
        // animação de iniciar o menu
        for (i = 0; i < j; i++)
        {
            system("cls");
            teste = j - 1 - i;
            for (tempo = 0; tempo < 80000000; tempo++) // isso eh so pra nao printar instantaneamente....
            {
                if (tempo == 400000)
                {
                    for (menu_contador = teste; menu_contador <= j; menu_contador++)
                    {
                        printf("%s", menuletra[menu_contador]);
                    }
                }
            }
        }

        printf("\nPara jogar digite 1\nPara ver os créditos digite 2");
        printf("\nPara sair do programa digite 3\nPara desenhar todos os mapas, digite 5\n");
        scanf("%d", &menu);

        if (menu == 1)
        {
            for (i = 0; i < 50; i++)
            {
                printf("%s", cutscene1[i]);
            }

            printf("Digite algo e dê enter para continuar\n");
            system("pause");
            while (morto == 0)
            {

                PosInicialVariavel();
                embaixoDoJogador = 'g';
                while (faseatual == 0)
                {
                    RodarOJogo();
                }
                embaixoDoJogador = ' ';
                while (faseatual == 1)
                {
                    RodarOJogo();
                }
                embaixoDoJogador = ' ';
                while (faseatual == 2)
                {
                    RodarOJogo();
                }
                embaixoDoJogador = ' ';
                while (faseatual == 3)
                {
                    RodarOJogo();
                }
                if (faseatual == 4)
                {
                    printf("parabéns!!! você finalizou o jogo!!!");
                    system("pause");
                    faseatual = 0;
                    jogadorX = 1;
                    jogadorY = 1;
                    posInicialX = 1;
                    posInicialY = 1;
                    chaveColetada = 0;
                    reinicios = 0;
                    menu = 0;
                    break;
                    system("pause");
                }
            }
        }
        if (menu == 2)
        {
            printf("teste -- essa eh a pagina menu 2\n");
        }

        if (menu == 3)
        {
            printf("Até logo jogador!\n");
        }
        if (menu == 5)
        {

            for (linha = 0; linha < 10; linha++)
            {
                for (coluna = 0; coluna < 10; coluna++)
                {
                    int valorandom = rand() % 2;

                    if (valorandom == 0 && mapa[0][linha][coluna] == 'g')
                    {
                        printf(GREEN "'" RESET " " /*,mapa[0][linha][coluna]*/);
                    }
                    else if (valorandom == 1 && mapa[0][linha][coluna] == 'g')
                    {
                        printf(GREEN "," RESET " " /*,mapa[0][linha][coluna]*/);
                    }
                    else
                    {
                        printf("%c ", mapa[0][linha][coluna]);
                    }
                }
                printf("\n");
            }
            for (linha = 0; linha < 10; linha++)
            {
                for (coluna = 0; coluna < 10; coluna++)
                {
                    printf("%c ", mapa[1][linha][coluna]);
                }
                printf("\n");
            }
            for (linha = 0; linha < 20; linha++)
            {
                for (coluna = 0; coluna < 20; coluna++)
                {
                    printf("%c ", mapa[2][linha][coluna]);
                }
                printf("\n");
            }
            for (linha = 0; linha < 40; linha++)
            {
                for (coluna = 0; coluna < 40; coluna++)
                {
                    printf("%c ", mapa[3][linha][coluna]);
                }
                printf("\n");
            }

            system("pause");
        }
    }

    return 0;
}
